# Groupby

### used to select rows and columns

In [1]:
import pandas as pd

In [20]:
sales_data = {
    "Producer": ["Tesla", "Porsche", "Hyundai","Ford","Porsche","Hyundai"],
"Sales_person" : ["Swati","Preeti","Priyanka","Jyoti","Nikhil","Charice"],
    "Sale": [10,30, 20, 40,90,120]
}
sales_data

{'Producer': ['Tesla', 'Porsche', 'Hyundai', 'Ford', 'Porsche', 'Hyundai'],
 'Sales_person': ['Swati', 'Preeti', 'Priyanka', 'Jyoti', 'Nikhil', 'Charice'],
 'Sale': [10, 30, 20, 40, 90, 120]}

In [21]:
#creating data frame using dictionary
sales_frame = pd.DataFrame(sales_data)
sales_frame

  Producer Sales_person  Sale
0    Tesla        Swati    10
1  Porsche       Preeti    30
2  Hyundai     Priyanka    20
3     Ford        Jyoti    40
4  Porsche       Nikhil    90
5  Hyundai      Charice   120

In [22]:
company_sales = sales_frame.groupby("Producer")

In [23]:
#printing total sum of sales of each producer
(company_sales.sum())

          Sale
Producer
Ford        40
Hyundai    140
Porsche    120
Tesla       10

In [26]:
(company_sales.mean())

          Sale
Producer
Ford        40
Hyundai     70
Porsche     60
Tesla       10

In [25]:
company_sales.max()

         Sales_person  Sale
Producer
Ford            Jyoti    40
Hyundai      Priyanka   120
Porsche        Preeti    90
Tesla           Swati    10

In [28]:
#printing minimum sale of each producer
company_sales.min()

         Sales_person  Sale
Producer
Ford            Jyoti    40
Hyundai       Charice    20
Porsche        Nikhil    30
Tesla           Swati    10

In [29]:
company_sales.describe()         #statistics

          Sale
         count  mean        std   min   25%   50%   75%    max
Producer
Ford       1.0  40.0        NaN  40.0  40.0  40.0  40.0   40.0
Hyundai    2.0  70.0  70.710678  20.0  45.0  70.0  95.0  120.0
Porsche    2.0  60.0  42.426407  30.0  45.0  60.0  75.0   90.0
Tesla      1.0  10.0        NaN  10.0  10.0  10.0  10.0   10.0

In [30]:
company_sales.describe().transpose()

Producer    Ford     Hyundai    Porsche  Tesla
Sale count   1.0    2.000000   2.000000    1.0
     mean   40.0   70.000000  60.000000   10.0
     std     NaN   70.710678  42.426407    NaN
     min    40.0   20.000000  30.000000   10.0
     25%    40.0   45.000000  45.000000   10.0
     50%    40.0   70.000000  60.000000   10.0
     75%    40.0   95.000000  75.000000   10.0
     max    40.0  120.000000  90.000000   10.0

In [31]:
company_sales.describe().transpose()["Hyundai"]

Sale  count      2.000000
      mean      70.000000
      std       70.710678
      min       20.000000
      25%       45.000000
      50%       70.000000
      75%       95.000000
      max      120.000000
Name: Hyundai, dtype: float64